Revit 2027 API
BuiltInFailures.FabricAreaFailures.FabricAreaOutSideOfHost Property
 Fabric Area is sketched completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricAreaOutSideOfHost { get; }
Public Shared ReadOnly Property FabricAreaOutSideOfHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricAreaOutSideOfHost {
	FailureDefinitionId^ get ();
}
static member FabricAreaOutSideOfHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricAreaFailures Class
Autodesk.Revit.DB Namespace